# IdeaStatiCa.ConnectionApi.Model.ConResultSummary

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**Passed** | **bool** |  | [optional]
**ResultSummary** | **List&lt;CheckResSummary&gt;** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)